app/controllers/workouts_controller.rb

SELECT "workouts".* FROM "workouts" WHERE "workouts"."user_id" = ?  [["user_id", 2]]
---
    def index
        render json: current_user.workouts.all, status: :created

INSERT INTO "workouts" ("workout_name", "minutes_to_complete", "date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        workout= Workout.create(workout_params.merge(user_id: session[:user_id]))